IDENTIFICATION DIVISION.
PROGRAM-ID. HOLA.
AUTHOR. HIRONAKAMURA.
INSTALLATION. GITHUB.
SECURITY. CONFIDENCIAL.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. HP.
OBJECT-COMPUTER. HP.


PROCEDURE DIVISION.
DISPLAY '****************************'.
DISPLAY '**  PROGRAMANDO EN COBOL  **'.
DISPLAY '                            '.
DISPLAY '       HOLA, MUNDO!!        '.
DISPLAY '        ----   ----         '.
DISPLAY '       @HIRONAKAMURA        '.
DISPLAY '****************************'.
STOP RUN.
