IDENTIFICATION DIVISION.
PROGRAM-ID. CAPITULO-9.
DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 NUM1 PIC 9(4).
01 NUM2 PIC 9(4).
01 RESULTADO PIC 9(5).
PROCEDURE DIVISION.
MAIN-PROCEDURE.
	DISPLAY "Introduce el primer número: ".
	ACCEPT NUM1.
	DISPLAY "Introduce el segundo número: ".
	ACCEPT NUM2.
	ADD NUM1 TO NUM2 GIVING RESULTADO.
	IF RESULTADO > 50
	    DISPLAY "El resultado es mayor que 50.".
	STOP RUN.
END PROGRAM CAPITULO-9.